1.序列化与反序列化:
2.Java 对象的序列化与反序列化:
3.使用场景及相关接口:




-------------------------------------------------------------------------------------------------------
1.序列化与反序列化:

    序列化 (Serialization)是将对象的状态信息转换为可以存储或传输的形式的过程。
一般将一个对象存储至一个储存媒介，例如档案或是记亿体缓冲等。
在网络传输过程中，可以是字节或是XML等格式。而字节的或XML编码格式可以还原完全相等的对象。
这个相反的过程又称为反序列化。


-------------------------------------------------------------
2.Java 对象的序列化与反序列化:

    在 Java中，我们可以通过多种方式来创建对象，并且只要对象没有被回收我们都可以复用该对象。
但是，我们创建出来的这些 Java 对象都是存在于 JVM 的堆内存中的。
只有JVM处于运行状态的时候，这些对象才可能存在。一旦JVM停止运行，这些对象的状态也就随之而丢失了。

    但是在真实的应用场景中，我们需要将这些对象持久化下来，并且能够在需要的时候把对象重新读取出来。
Java 的对象序列化可以帮助我们实现该功能。

    对象序列化机制（object serialization）是 Java 语言内建的1种对象持久化方式，通过对象序列化，
可以把对象的状态保存为字节数组，并且可以在有需要的时候将这个字节数组通过反序列化的方式再转换成对象。
对象序列化可以很容易的在JVM中的活动对象和字节数组（流）之间进行转换。


-------------------------------------------------------------
3.使用场景及相关接口:

    在 Java 中，对象的序列化与反序列化被广泛应用到 RMI(远程方法调用)及网络传输中。

--------------------------------
相关接口及类:

java.io.Serializable

java.io.Externalizable

ObjectOutput

ObjectInput

ObjectOutputStream

ObjectInputStream