1.形式上:
2.含义上:
3.占内存大小:






--------------------------------------------------------------------------------------------------------------------------------------------------------

1.形式上:

    字符常量是单引号引起的1个字符 字符串常量是双引号引起的若干个字符

-------------------------------------------------------------

2.含义上:
    字符常量相当于一个整形值( ASCII 值),可以参加表达式运算字符串常量代表一个地址值(该字符串在内存中存放位置)



-------------------------------------------------------------

3.占内存大小:

    字符常量只占2个字节，字符串常量占若干个字节(至少1个字符结束标志) (注意： char在Java中占两个字节)


char:字符型常量 
String:字符串常量