三三原则
说出自己的三个优点

我的长处主要有三个
1.是什么
2.早什么
3.是什么


然后接下来依依简介
每个点可以为下面四小点总结
1)情境
2)任务
3)行动
4)结果



我的长处主要有三个，
1.是责任心强
2.是热爱学习
3.爱动脑筋



1.
在做物流项目和订餐项目的时候，有大概1个月的时间是并行开发的。
我的工作是后台开发，包括数据库设计和代码开发。这是开发经理给我安排的任务。

  但是我会把这个事情看成是自己的事情。
  我1个人要编写功能设计文档，数据库设计文档，要写后台代码，
  写完后台代码，会给出单元测试报告，再跟前端联调接口，
  然后再根据现有的功能页面出1份单元测试报告
  给到测试，督促测试同事安排测试，然后跟进情况。
  最后测试同事出了测试详细报告之后，我再让产品同事
  确认功能，如果没有问题，就让他们发起发版流程，
  最后再跟进发版的情况。然后，再把新增或者修改的功能
  整理出来，给到产品。


2.热爱学习
  下班或者周末的时候，大部分时间我是在家学习的。自己也买了1些书，然后买了1些视频。现在的目标是先学习
  相关的技术点，把技术点掌握起来。然后接下来会进行1个知识的整合，将自己学习的技术整合起来运用。


3.爱动脑筋
  爱动脑筋这1点，体现在项目上。当时做物流系统，涉及到发货单和客户数据的问题。当时的做法是用定时器去取数据。
  但是产品同事没有考虑到会有数据修改的问题存在，所以我当时发现之后，就跟他沟通清楚，需要跟用户确认，哪些
  字段的数据会修改，数据同步时需要做1下处理。包括很多其他页面的建议。例如订餐系统有个需要是要能够看到客人
  订餐的数据报表，产品同事要求将客人订餐的数据整合到普通用户的数据，我考虑到用户的角度和数据存储方式的不同，
  建议他另外写1个页面专门用于查询客人订餐数据。虽然最后没有采纳我的意见，但是后期需求修改时，客户要求的就是
  我建议的1个方式。





 
搭过1个定时器项目，因为项目之间的依赖关系的原因，最终组长考虑将定时器模块从项目中抽取出来单独做1个项目。




