1.货币
2.比特币信任从何而来
3.比特币简介:数字货币(去中心化记账系统)
4.总结:


--------------------------------------
1.货币:
  可以承载价值的一般等价物(铜币、金银、银票、法币)
  银票与法币并没有实际的价值，只是我们都信任并愿意使用，就有了价值。

数字货币:
  一串数字，价值来源于信任。
----------

2.比特币信任从何而来
  2.1.财产只受自己控制(比特币财产只受自己的私钥控制，如果是在银行中，银行可以认为你的钱来路不明，并没收)
  2.2无通货膨胀(比特币总共发行2100万个，不用担心因为发行更多的比特币而贬值)
  2.3.没有假钞(任何作弊的操作，都无法得到其他矿工的确认，无法完成支付)
  2.4.流通性好(可以无国际地流通，点对点直接到账)
----------

3.比特币简介:数字货币(去中心化记账系统)
  3.1.中心化系统:
  例如mysql,oracl等数据库就是一个中心化的系统。
  通过这个中心化，达到数据的准确与一致性。
  3.2.去中心化记账系统:
  数据存在于网络中每个节点中，如果每个节点是每个人的电脑，则数据存在于每个人的电脑中。每个节点中都有一个对应的账本。


----------

4.总结:

  一个点对点的电子现金系统。完全去中心化，数据存在于用户各自的机器上。
  数据分散一个个的区块，并通过HASH的方式将数据连接起来，形成一个区块链。

大家都有权力记账，货币不能智能超发。























-------------------------------------------------------------------------
Hash，一般翻译做“散列”，也有直接音译为“哈希”的，就是把任意长度的输入（又叫做预映射， pre-image），通过散列算法，变换成固定长度的输出，该输出就是散列值。

这种转换是一种压缩映射，也就是，散列值的空间通常远小于输入的空间，不同的输入可能会散列成相同的输出，所以不可能从散列值来确定唯一的输入值。简单的说就是一种将任意长度的消息压缩到某一固定长度的消息摘要的函数。