焦距:

这个数字越小，我们叫焦距越短，我们的视野就越宽，取景范围就越广，画面中容纳的景物也就越多，但是每个景物在画面中占的面积就越小。

这个数字越大，我们叫焦距越长，我们的视野就越窄，取景范围就越窄，画面中容纳的景物也就越少，但是每个景物在画面中占得面积就越大。


总结1句话:
近大远小

近景，大焦距
远景，小焦距






➤➤24mm和28mm：

    这就是一个标准的广角焦距，主要就是用来拍摄风景。
当然拍摄到此一游照也是很好的。如果你非抬杠说也能拍人像，确实也能，但是这个焦距的风光片要远远多于其它题材。
24mm相比28mm来说，就是更广一点。所以更好。



➤➤35mm：

    有人说这是大师的焦距，也被称为人文眼。简单地说就是拍摄人文最好的焦距。
之前有人问我：你在上一篇文章中说85mm不是拍摄人像最好的嘛？为什么又说35mm是拍人文的？
恰恰一字之差，有了这个区别。拍摄人像是要突出人，自然要弱化背景——要么裁切出画面，要么背景虚化掉。
85mm擅长的就是这个。而拍摄人文照片的时候需要主体和背景环境的关系，
所以小广角的35mm既能够将背景囊括进来，又可以保留足够的景深。


➤➤50mm：

这被称为标准镜头，人文、人像都是很好的。也是大师的焦距。
对于50mm标头的表述实在太多太多。我只说一点吧，我遇到过的人大多数要么喜欢35mm（比如我），要么喜欢50mm（比如布列松，哎呦我勒个去），
这种差异基本上都是表现在人文拍摄时你习惯的视角。所以我觉得这俩焦距用好一个就不易，挑一个，一直坚持下去吧。


➤➤85mm：

说得很多了，就是拍摄人像的镜头。能有很好的背景虚化效果，很好地画面裁切能力，还能保持和模特之间适当的交流距离。