1.语法格式
2.批量执行解压缩文件
3.批量添加指定数量的用户










----------------------------------------------------------------------------
1.语法格式
1.1:语法格式1
for 变量 in 值1 值2 值3 ...
	do
		程序
	done

程序:(循环输出 12345 )
#!/bin/bash
for i in 1 2 3 4 5
    do 
		echo $i
	done

------------
1.2:语法格式2
for(( 初始值;循环控制条件;变量变化 ))
	do 
	  程序
	done

程序:
#!/bin/bash
s=0
for((i=1;i<=100;i=i+1))
	do
		s=$(( $s+$i ))
	done
echo "$s"

------------------------------------------
2.批量执行解压缩文件
思路:
2.1:
将以 .tar.gz 结尾的文件输出到 ls.log 文件中
2.2:
利用 for 循环将文件批量解压



程序:
#!/bin/bash
cd /root/test/
ls *.tar.gz > ls.log
ls *.tgz >> ls.log
for i in $( cat ls.log )
	do 
	tar -zxf &i &> /dev/null
	done
rm-rf ls.log

------------------------------------------
3.批量添加指定数量的用户