1:List:对付顺序的好帮手
2:Set:注重独1无二的性质
3:Map:用 Key 来搜索的专家



----------------------------------------------------------------------------------------------------------------------
1:List:对付顺序的好帮手

List 接口存储1组不唯1（可以有多个元素引用相同的对象），有序的对象


---------------------------------------------------------------
2:Set:注重独1无二的性质

不允许重复的集合。不会有多个元素引用相同的对象。
 

---------------------------------------------------------------
3:Map:用 Key 来搜索的专家

    使用键值对存储。Map 会维护与 Key 有关联的值。两个 Key 可以引用相同的对象，
但 Key 不能重复，典型的 Key 是 String 类型，但也可以是任何对象。