1.进程查看 top 命令
2.top 命令详解










---------------------------------------------------------------------------------------------------

1.进程查看 top 命令
默认每三秒刷新1次进程查看信息
类似 windows 系统的查看进程

-d:秒数，指定 top 命令每隔几秒更新。默认是3秒
-b:使用批处理模式输出。一般和 "-n" 选项合用
-n:次数，指定 top 命令执行的次数。一般和"-b"选项合用

在 top 命令的交互模式当中可以执行的命令:
? 或 h: 显示交互模式的帮助
P:以 CPU 使用率排序，默认就是此项
M: 以 内存的使用率排序
N: 以 PID 排序
q:退出 top



---------------------------------------------
2.top 命令详解

前五行输出命令的解释，参照图片


top -b -n 1

top - 14:06:19 up 59 days, 17:33,  1 user,  load average: 0.46, 0.83, 0.58
Tasks:  27 total,   1 running,  26 sleeping,   0 stopped,   0 zombie
%Cpu(s): 22.9 us,  1.3 sy,  0.0 ni, 73.9 id,  1.8 wa,  0.0 hi,  0.1 si,  0.
KiB Mem :  8175596 total,   435416 free,  2477948 used,  5262232 buff/cache
KiB Swap:        0 total,        0 free,        0 used.  5268744 avail Mem 

  PID USER      PR  NI    VIRT    RES    SHR S  %CPU %MEM     TIME+
   77 shiyanl+  20   0  368116   9060   6856 S   6.7  0.1   0:00.04
    1 root      20   0   22124   1644   1392 S   0.0  0.0   0:00.02
   26 shiyanl+  20   0  248744  34376  13612 S   0.0  0.4   0:00.19
   42 shiyanl+  20   0    4492    644    560 S   0.0  0.0   0:00.00
   44 shiyanl+  20   0    4492    708    616 S   0.0  0.0   0:00.00
   45 root      20   0   52204  15584   3548 S   0.0  0.2   0:00.25
   56 shiyanl+  20   0  261884  10292   8328 S   0.0  0.1   0:00.27
   59 shiyanl+  20   0   43720    828    400 S   0.0  0.0   0:00.00
   60 shiyanl+  20   0   43020   1488    888 S   0.0  0.0   0:00.03
   62 shiyanl+  20   0   47624   2700   2212 S   0.0  0.0   0:00.02
   68 shiyanl+  20   0   11128    308      0 S   0.0  0.0   0:00.00
   70 shiyanl+  20   0  184428  10460   8484 S   0.0  0.1   0:00.07
   74 shiyanl+  20   0  364440  13812  10916 S   0.0  0.2   0:00.08
   76 shiyanl+  20   0  169040   6884   5476 S   0.0  0.1   0:00.01
   79 shiyanl+  20   0  483028  18800  12120 S   0.0  0.2   0:00.25
   85 shiyanl+  20   0  442620   5968   4364 S   0.0  0.1   0:00.01
   88 root      20   0   65496   3248   2536 S   0.0  0.0   0:00.00
   92 shiyanl+  20   0  328452   3736   2704 S   0.0  0.0   0:00.00
   98 shiyanl+  20   0  275844   3500   2884 S   0.0  0.0   0:00.01
   99 shiyanl+  20   0  148896   5544   4396 S   0.0  0.1   0:00.00
  104 shiyanl+  20   0   62728   2840   2368 S   0.0  0.0   0:00.00
  115 shiyanl+  20   0  157876   7576   6044 S   0.0  0.1   0:00.00
  126 shiyanl+  20   0  273628   3344   2776 S   0.0  0.0   0:00.00
  133 root      20   0   92812   4016   3088 S   0.0  0.0   0:00.01
  142 shiyanl+  20   0   92812   1900    980 S   0.0  0.0   0:00.03
  143 shiyanl+  20   0   47984   4512   2396 S   0.0  0.1   0:01.01
  240 shiyanl+  20   0   42668   1732   1340 R   0.0  0.0   0:00.00