1.kill 命令，单个杀进程
2.killall
3.pkill (按终端号踢出用户)





--------------------------------------------------------------------------------
1.kill 命令，单个杀进程
后面跟PID

1.1
查看可用的进程信号，可支持64个信号
kill -l 
常用信号解析见图
按照PID杀死进程:
kill -HUP 1523   相当于   kill -1 1523

重启进程:
kill -1 2335
强制杀死进程:
kill -9 2235

---------------------------------------------
2.killall

按照进程名杀死进程
killall [选项][信号] 进程名
选项:
	-i:交互式，询问是否要杀死某个进程
	-I:忽略进程名的大小写

杀死所有 appache 进程 
killall -9 httpd


---------------------------------------------
3.pkill (按终端号踢出用户)
按照进程名终止进程
pkill [选项][信号] 进程名
选项:
	-t 终端号:按照终端号踢出用户


只有超级用户可以踢出其他用户
pkill -9 -t pts/1