1.握笔姿势:
2.找支点:
3.为什么横总是直不直:
4.为什么竖总是写不直








-----------------------------------------------------------------------------------------------------------------------------
1.握笔姿势:
笔杆靠在食指尾部
竖笔由食指上下划动完成



--------------------------------------------------------------
2.找支点:
以整个右手掌的最左下角的骨头为主支点
小食指作为辅助支点


--------------------------------------------------------------
3.为什么横总是直不直:
  主要秘诀是以主支点为轴，去运动整个手画这1笔，做也横摆动作，而不要以食指去运动。
手腕动，食指不动。


--------------------------------------------------------------
4.为什么竖总是写不直:
  食指动，手腕不动。

横摆手，竖点头