1.主动掌控时间
2.学会说不






-------------------------------------------------------------------------------------------------------------------
1.主动掌控时间

    无论什么事情，如果你发现你持续处于被动的状态下，那么你1定要停下来想1想如何把被动变为主动。
因为在被动的方式下工作，你是不可能做好工作的，无论什么事我是1个非常不喜欢被动的人。
所以，对于任何被动状态，我都要“反转控制”，想尽1切方式变成主动。


    如果你发现你的时间老是被别人打断，那么你就要告诉大家，我什么时间段在做什么事，请大家不要打扰我。


----------------------------------------------------------
2.学会说不
2.1
  当你面对做不到的需求时，你不要说这个需求做不到。尤其是，你不要马上说做不到，你要先想1下，这样让别人觉得你是想做的，
但是，在认真思考过后，你觉得做不到，并且给出1个你觉得做得到的方案。这里的诀窍是——给出另1个你可以做到的方案，而不是把对方的方案直接回绝掉

2.2
  当你面对过于复杂的需求时，你不要说不。你要反问1下，为什么要这样做？这样做的目的是什么？当了解完目的以后，
你可以给出1个自己的方案，或是和对方讨论1个性价比更好的方案。你可以回复说，这个需求好复杂，我们能不能先干这个，再做那个，
这样会更经济1些。这里的诀窍是——我不说我不能完全满足你，但我说我可以部分满足你。

2.3
当你面对时间完全不够的需求时，你也不要说不。既然对方把压力给你，你要想办法把这个压力还回去，或是让对方来和你1同分担这个压力。




这个时候，我惯用的方式是给回三个选择：
a. 我可以加班加点完成，但是我不保证好的质量，有 bug 你得认，而且事后你要给我 1 个月的时间还债
b. 我可以加班加点，还能保证质量，但我没办法完成这么多需求，能不能减少1些？
c. 我可以保质保量地完成所有的需求，但是，能不能多给我 2 周时间？

我不能说不，但是我要有条件地说是。而且，我要把你给我的压力再反过来还给你，看似我给了需求方选择，实际上，我掌握了主动