1.投资自己的时间
2.规划自己的时间












-------------------------------------------------------------------------------------------------------------
1.投资自己的时间

1.1:花时间学习基础知识，花时间读文档
1.2:花时间在解放自己生产力的事上
1.3:花时间在让自己成长的事上
1.4:花时间在建立高效的环境上



-----------------------------------------------------
2.规划自己的时间

2.1:划分优先级
  无论你写不写出来，你1定都会有1个自己的 to-do list。有 to-do list 并不是什么高深的事。
更重要的是，你要知道什么事是重要的，什么事是紧急的，什么事重要但不紧急，什么事又重要又紧急。这有利于你划分优先级。

2.2:最短作业优先
  对于相同优先级的事，我个人喜欢的是“最短作业优先”的调度算法。理由是，先把可以快速做完的事做完，
看到 to-do list 上划掉1个任务，看到任何的数据在减少，对于自己也好，对于老板也好。老板可以看到你的工作进度飞快，
1方面有利于为后面复杂的工作争取更多的时间（老板只有在你有 Deliver 的时候才愿意给你更多的时间），
另1方面，看到任务列表的减少会让你的心态更为积极。

2.3:想清楚再做
  我发现很多时候，我们没有想清楚就开干了，边干边想，这样的工作方式其实很糟糕。
你会发现，如果你没有想清楚，你总是要对已完成的工作进行返工，返工好几次，其实是非常浪费时间的。
所以，对于1些没想清楚的事，或是自己不太有信心的事，还是先看看有没有已有的成熟解决方案，或是找更牛的人来给你把把关，
帮你出出主意，看看有没有更好、更简单的方式。