1.介绍:
2.例子:
3.创建镜像:
4.查看已存在的镜像:
5.运行镜像:






-------------------------------------------------------------------------------------
1.介绍:

    通过编写简单的文件自创 docker 镜像



-----------------------------------------------
2.例子:
    
    
    创建1个文件名为 Dockerfile 的文件。

    FROM alpine:latest
    MAINTAINER xbf
    CMD echo 'hello docker'


-----------------------------------------------
3.创建镜像:
  
    docker build -t zhc/centos:6.7 .
    docker build -t hello_docker .


参数说明：
-t ：指定要创建的目标镜像名
. ：Dockerfile 文件所在目录，可以指定 Dockerfile 的绝对路径



-----------------------------------------------
4.查看已存在的镜像:

    docker images


-----------------------------------------------
5.运行镜像:

    docker run hello_docker