1.shutdown 关机命令
2.其他关机命令
3.其他重启命令
4.系统运行级别
5.查询和修改系统默认运行级别
6.退出登录命令






-------------------------------------------------------------------
1.shutdown 关机命令
shutdown 选项 时间
选项:
	-c:取消前1个关机命令
	-h:关机
	-r:重启

例子:
shutdown -r  05:30
5点半重启系统

shutdown -r now 
立即重启系统


---------------------------------
2.其他关机命令
halt
poweroff
init 0 

---------------------------------
3.其他重启命令
reboot
init 6

---------------------------------
4.系统运行级别
0:关机
1:单用户
2:不完全多用户，不含NFS服务
3:完全多用户
4:未分配
5:图形界面
6:重启


---------------------------------
5.查询和修改系统默认运行级别

runlevel
查看进入的级别历史记录
N 3 5
代表:从N到3级别，再从3级别到5级别。

修改系统默认运行级别
cat /etc/inittab
id:3:initdefault:

---------------------------------
6.退出登录命令
logout